In [2]:

import pandas as pd
import numpy as np

In [2]:
#Series is one-dimensional
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s2 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'],dtype = float)
s2

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

In [7]:
s2['a']

1.0

In [9]:
s3 = pd.Series({"a":100,"b":200,"c":300})
s3

a    100
b    200
c    300
dtype: int64

In [10]:
s3["b"]

200

In [12]:
#DataFrame is two-dimensional
d1 = pd.DataFrame([1,2,3])
d1

   0
0  1
1  2
2  3

In [16]:
d2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns =["a",'b',"c"],index = ["x","y","z"],dtype = float)
d2

     a    b    c
x  1.0  2.0  3.0
y  4.0  5.0  6.0
z  7.0  8.0  9.0

In [17]:
dic = [{"alex":1,"joe":2},{"ema":5,"alice":20,"dora":10}]
pd.DataFrame(dic,index=["a","b"])

   alex  joe  ema  alice  dora
a   1.0  2.0  NaN    NaN   NaN
b   NaN  NaN  5.0   20.0  10.0

In [18]:
d2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns =["a",'b',"c"],index = ["x","y","z"])
d2['a']

x    1
y    4
z    7
Name: a, dtype: int64

In [20]:
d2['d']=d2['a']*d2['b']
d2['e']=d2['a']+d2["d"]
d2

   a  b  c   d   e
x  1  2  3   2   3
y  4  5  6  20  24
z  7  8  9  56  63

In [22]:
#pop is function
d2.pop('b')
d2

   a  c   d   e
x  1  3   2   3
y  4  6  20  24
z  7  9  56  63

In [24]:
#del is keyword
del d2['d']
d2

   a  c   e
x  1  3   3
y  4  6  24
z  7  9  63

In [25]:
d2.insert(1,'new',d2['e']) #(loc,colname,data)
d2

   a  new  c   e
x  1    3  3   3
y  4   24  6  24
z  7   63  9  63

In [29]:
d3=pd.DataFrame({"abc":np.random.randint(2,6,size=(10)),"bcd":np.random.randint(4,10,size=(10)),"cde":np.random.randint(3,9,size=(10))})

d3

   abc  bcd  cde
0    5    9    5
1    3    8    3
2    4    8    8
3    3    9    5
4    2    5    7
5    5    7    5
6    4    9    3
7    2    8    3
8    2    7    4
9    3    4    8

In [30]:
d3.head()

   abc  bcd  cde
0    5    9    5
1    3    8    3
2    4    8    8
3    3    9    5
4    2    5    7

In [31]:
d3.tail()

   abc  bcd  cde
5    5    7    5
6    4    9    3
7    2    8    3
8    2    7    4
9    3    4    8

In [32]:
d3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 248.0 bytes

In [33]:
d3.loc[9,'cde']

8

In [34]:
d3.loc[4:9,['abc','cde']]

   abc  cde
4    2    7
5    5    5
6    4    3
7    2    3
8    2    4
9    3    8

In [36]:
d3.loc[[3,4,5],['abc','cde']]

   abc  cde
3    3    5
4    2    7
5    5    5

In [37]:
# iloc works with index
d3.iloc[2,0]

4

In [38]:
d3.iloc[2:5,[0,2]]

   abc  cde
2    4    8
3    3    5
4    2    7

In [9]:
import pandas as pd
dfl=pd.DataFrame([['rk',102,15000],['rama',103,20000],['krishna',104,25000]],columns = ['Name','id','salary'])
dfl

      Name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000

In [12]:
y = dfl[dfl.salary>=20000]
print(y)
y[['id','salary']]

      Name   id  salary
1     rama  103   20000
2  krishna  104   25000

    id  salary
1  103   20000
2  104   25000

In [17]:
dfl=dfl.append({'Name':'sahithi','id':104,'salary':30000},ignore_index = True)
dfl

C:\Users\sahithik\AppData\Local\Temp\ipykernel_9352\3295118213.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfl=dfl.append({'Name':'sahithi','id':104,'salary':30000},ignore_index = True)

      Name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000
3  sahithi  104   30000

In [42]:
dfl=dfl.append({'Name':np.NaN,'id':105,'salary':30000},ignore_index = True)
dfl

C:\Users\sahithik\AppData\Local\Temp\ipykernel_9352\1415329197.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfl=dfl.append({'Name':np.NaN,'id':105,'salary':30000},ignore_index = True)

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0
5      nan  104.0  30000.0
6      nan  105.0  30000.0
7      NaN  105.0  30000.0
8      NaN  105.0  30000.0

In [21]:
dfl.isnull()

    Name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5   True  False   False

In [25]:
dfl.isnull().sum()

Name      1
id        0
salary    0
dtype: int64

In [27]:
dfl=dfl.dropna()
dfl

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0

In [44]:
dfl=dfl.append({'Name':np.NaN,'id':105,'salary':30000},ignore_index = True)
dfl

C:\Users\sahithik\AppData\Local\Temp\ipykernel_9352\1415329197.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfl=dfl.append({'Name':np.NaN,'id':105,'salary':30000},ignore_index = True)

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0
5      nan  104.0  30000.0
6      nan  105.0  30000.0
7      NaN  105.0  30000.0

In [45]:
dfl = dfl.dropna()
dfl

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0
5      nan  104.0  30000.0
6      nan  105.0  30000.0

In [46]:
dfl = dfl.fillna(value = 'abc')
dfl

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0
5      nan  104.0  30000.0
6      nan  105.0  30000.0

In [47]:
dfl=dfl.append({'Name':np.NaN,'id':105,'salary':30000},ignore_index = True)
dfl

C:\Users\sahithik\AppData\Local\Temp\ipykernel_9352\1415329197.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfl=dfl.append({'Name':np.NaN,'id':105,'salary':30000},ignore_index = True)

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0
5      nan  104.0  30000.0
6      nan  105.0  30000.0
7      NaN  105.0  30000.0

In [48]:
dfl.fillna(value = 'abc')

      Name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3  sahithi  104.0  30000.0
4   np.nan  105.0  30000.0
5      nan  104.0  30000.0
6      nan  105.0  30000.0
7      abc  105.0  30000.0

In [51]:
df = pd.DataFrame({'Animal':['Falcon','parrot','Falcon','parrot'],'Max Speed':[370,36,380,35]})
df

   Animal  Max Speed
0  Falcon        370
1  parrot         36
2  Falcon        380
3  parrot         35

In [4]:
df.groupby(['Animal']).mean()

NameError: name 'df' is not defined

In [53]:
df1 = pd.DataFrame({'name':["sally","peter","john"],"age":[10,20,30]})
df2 = pd.DataFrame({"name":["sally","mickey","mary"],"age":[40,50,60]})
newdf =df1.merge(df2,how = 'right')
print(newdf)

     name  age
0   sally   40
1  mickey   50
2    mary   60

In [54]:
df2.merge(df1,how = 'left')

     name  age
0   sally   40
1  mickey   50
2    mary   60

In [55]:
df1.merge(df2,how = 'outer')

     name  age
0   sally   10
1   peter   20
2    john   30
3   sally   40
4  mickey   50
5    mary   60

In [56]:
df2.merge(df1,how='outer')

     name  age
0   sally   40
1  mickey   50
2    mary   60
3   sally   10
4   peter   20
5    john   30

In [57]:
df1.merge(df2,how='inner')

Empty DataFrame
Columns: [name, age]
Index: []

In [58]:
df2.merge(df1,how='inner')

Empty DataFrame
Columns: [name, age]
Index: []

In [59]:
pd.merge(df1,df2,on='name',how='left')

    name  age_x  age_y
0  sally     10   40.0
1  peter     20    NaN
2   john     30    NaN

In [61]:
pd.merge(df1,df2,on='name',how='right')

     name  age_x  age_y
0   sally   10.0     40
1  mickey    NaN     50
2    mary    NaN     60

In [62]:
pd.merge(df2,df1,on='name',how='left')

     name  age_x  age_y
0   sally     40   10.0
1  mickey     50    NaN
2    mary     60    NaN

In [63]:
pd.merge(df2,df1,on='name',how='right')

    name  age_x  age_y
0  sally   40.0     10
1  peter    NaN     20
2   john    NaN     30

In [64]:
pd.merge(df1,df2,on='name',how = 'inner')

    name  age_x  age_y
0  sally     10     40

In [65]:
pd.merge(df1,df2,on='name',how ='outer')

     name  age_x  age_y
0   sally   10.0   40.0
1   peter   20.0    NaN
2    john   30.0    NaN
3  mickey    NaN   50.0
4    mary    NaN   60.0